# -*- mode: org; coding: utf-8; -*-
#+TITLE: Ashfaq Farooqui's Emacs Configuration
#+AUTHOR: Ashfaq Farooqui
#+EMAIL: ashfaq@ashfaqfarooqui.me
#+OPTIONS: toc:3 num:nil
#+startup: overview



* Magit
#+BEGIN_SRC emacs-lisp
;;; :tools magit

(after! magit

 (setq magit-repository-directories '(("~/Code" . 2) ("~/Papers" . 2))
      magit-save-repository-buffers nil
      ;; Don't restore the wconf after quitting magit, it's jarring
      magit-inhibit-save-previous-winconf t
      transient-values '((magit-commit "--gpg-sign=7A804BCB51DE2D88")
                         (magit-rebase "--autosquash" "--gpg-sign=7A804BCB51DE2D88")
                         (magit-pull "--rebase" "--gpg-sign=7A804BCB51DE2D88")))

 (setq magit-repolist-columns
      '(("Name"    25 magit-repolist-column-ident                  ())
        ("Version" 25 magit-repolist-column-version                ())
        ("D"        1 magit-repolist-column-dirty                  ())
        ("Branch"  10 magit-repolist-column-branch                () )
        ("L<U"      3 magit-repolist-column-unpulled-from-upstream ((:right-align t)))
        ("L>U"      3 magit-repolist-column-unpushed-to-upstream   ((:right-align t)))
        ("Path"    99 magit-repolist-column-path                   ())))


)
#+END_SRC

#+RESULTS:
| Name    | 25 | magit-repolist-column-ident                  | nil                |
| Version | 25 | magit-repolist-column-version                | nil                |
| D       |  1 | magit-repolist-column-dirty                  | nil                |
| B       | 10 | magit-repolist-column-branch                 | nil                |
| L<U     |  3 | magit-repolist-column-unpulled-from-upstream | ((:right-align t)) |
| L>U     |  3 | magit-repolist-column-unpushed-to-upstream   | ((:right-align t)) |
| Path    | 99 | magit-repolist-column-path                   | nil                |

** posframe
#+BEGIN_SRC emacs-lisp
(after! ivy-posframe
  (setf (alist-get t ivy-posframe-display-functions-alist)
        #'ivy-posframe-display-at-frame-top-center)
  (setf (alist-get 'swiper ivy-posframe-display-functions-alist)
        #'ivy-posframe-display-at-frame-top-center)
  (setq ivy-posframe-border-width 10
        ivy-posframe-parameters (append ivy-posframe-parameters '((min-width . 120)
                                                                  (left-fringe . 3)
                                                                  (right-fringe . 3)))))


(setq ivy-posframe-width 120)


(setq posframe-arghandler
      (lambda (_buffer-or-name key value)
        (or (eq key :lines-truncate)
            value)))
#+END_SRC

#+RESULTS:
| lambda | (_buffer-or-name key value) | (or (eq key :lines-truncate) value) |

** Buffer Name
#+BEGIN_SRC emacs-lisp




(defadvice! doom-modeline--reformat-roam (orig-fun)
  :around #'doom-modeline-buffer-file-name
  (message "Reformat?")
  (message (buffer-file-name))
  (if (s-contains-p org-roam-directory (or buffer-file-name ""))
      (replace-regexp-in-string
       "\\(?:^\\|.*/\\)\\([0-9]\\{4\\}\\)\\([0-9]\\{2\\}\\)\\([0-9]\\{2\\}\\)[0-9]*-"
       "🢔(\\1-\\2-\\3) "
       (funcall orig-fun))
    (funcall orig-fun)))




(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string ".*/[0-9]*-?" "🢔 " buffer-file-name)
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p)  " ◉ %s" "  ●  %s") project-name))))))
#+END_SRC

#+RESULTS:
|   | (:eval (if (s-contains-p org-roam-directory (or buffer-file-name )) (replace-regexp-in-string .*/[0-9]*-? 🢔  buffer-file-name) %b)) | (:eval (let ((project-name (projectile-project-name))) (unless (string= - project-name) (format (if (buffer-modified-p)  ◉ %s   ●  %s) project-name)))) |

** Theme
#+BEGIN_SRC emacs-lisp

(after! modus-operandi-theme
  :init
  ;; NOTE: Everything is disabled by default.
  (setq modus-operandi-theme-slanted-constructs t
        modus-operandi-theme-bold-constructs t
        modus-operandi-theme-fringes 'intense ; {nil,'subtle,'intense}
        modus-operandi-theme-modeline t
        modus-operandi-theme-faint-syntax t
        modus-operandi-theme-intense-hl-line t
        modus-operandi-theme-intense-paren-match t
        modus-operandi-theme-prompts 'subtle ; {nil,'subtle,'intense}
        modus-operandi-theme-completions 'opinionated ; {nil,'moderate,'opinionated}
        modus-operandi-theme-diffs 'nil ; {nil,'desaturated,'fg-only}
        modus-operandi-theme-org-blocks 'rainbow ; {nil,'greyscale,'rainbow}
        modus-operandi-theme-variable-pitch-headings t
        modus-operandi-theme-rainbow-headings t
        modus-operandi-theme-section-headings t
        modus-operandi-theme-scale-headings t
        modus-operandi-theme-scale-1 1.05
        modus-operandi-theme-scale-2 1.1
        modus-operandi-theme-scale-3 1.15
        modus-operandi-theme-scale-4 1.2
        modus-operandi-theme-scale-5 1.3))


(after! modus-vivendi-theme
  :init
  ;; NOTE: Everything is disabled by default.
  (setq modus-vivendi-theme-slanted-constructs t
        modus-vivendi-theme-bold-constructs t
        modus-vivendi-theme-fringes 'intense ; {nil,'subtle,'intense}
        modus-vivendi-theme-modeline t
        modus-vivendi-theme-faint-syntax nil
        modus-vivendi-theme-intense-hl-line t
        modus-vivendi-theme-intense-paren-match t
        modus-vivendi-theme-prompts 'subtle ; {nil,'subtle,'intense}
        modus-vivendi-theme-completions 'moderate ; {nil,'moderate,'opinionated}
        modus-vivendi-theme-diffs 'nil ; {nil,'desaturated,'fg-only}
        modus-vivendi-theme-org-blocks 'rainbow ; {nil,'greyscale,'rainbow}
        modus-vivendi-theme-variable-pitch-headings t
        modus-vivendi-theme-rainbow-headings t
        modus-vivendi-theme-section-headings t
        modus-vivendi-theme-scale-headings t
        modus-vivendi-theme-scale-1 1.05
        modus-vivendi-theme-scale-2 1.1
        modus-vivendi-theme-scale-3 1.15
        modus-vivendi-theme-scale-4 1.2
        modus-vivendi-theme-scale-5 1.3))


#+END_SRC

#+RESULTS:
: 1.3

*** Font Display
Mixed pitch is great. As is ~+org-pretty-mode~, let's use them.
#+begin_src emacs-lisp

(add-hook! 'org-mode-hook #'+org-pretty-mode #'mixed-pitch-mode)
(setq mixed-pitch-variable-pitch-cursor nil)

#+end_src

#+RESULTS:

Earlier I loaded the ~org-pretty-table~ package, let's enable it everywhere!
#+begin_src emacs-lisp
(setq global-org-pretty-table-mode t)
#+end_src

#+RESULTS:
: t

Let's make headings a bit bigger
#+begin_src emacs-lisp
(custom-set-faces!
  '(outline-1 :weight bold :height 1.15)
  '(outline-2 :weight bold :height 1.10)
  '(outline-3 :weight bold :height 1.09)
  '(outline-4 :weight semi-bold :height 1.04)
  '(outline-5 :weight semi-bold :height 1.03)
  '(outline-6 :weight semi-bold :height 1.0)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))
#+end_src

#+RESULTS:
| doom--customize-themes-h-25 |

And the same with the title.
#+begin_src emacs-lisp
(after! org
  (custom-set-faces!
    '(org-document-title :height 1.2)))
#+end_src
** org-agenda
Use all the files to derive agenda.
#+BEGIN_SRC emacs-lisp
(after! org
(setq org-agenda-files (list org-index-file org-inbox-file org-basb-main-file))
                                          ;   (setq org-agenda-include-diary t)
                                          ;   (setq org-agenda-include-all-todo t)
  (setq org-habit-show-habits-only-for-today t)


  ;; Do not dim blocked tasks
  (setq org-agenda-dim-blocked-tasks nil)

  ;; Compact the block agenda view
  (setq org-agenda-compact-blocks t)




  (use-package! org-super-agenda
    :after org
    :config
    (org-super-agenda-mode t)
    (setq org-super-agenda-groups
          '(
            (:name "Today\n"
                   :time-grid t
                   :and(:scheduled today :not (:habit t))
                   )
            (:name "Important"
                   :priority "A")
            (:name "Overdue"
                   :deadline past)
            (:name "Habits\n"
                   :habit t)
            (:name "To Scheduled\n"
                   :scheduled nil)
            )  ;; end setq superagenda block
          )) ;; end whole super agenda block


  (add-to-list 'org-agenda-custom-commands
               '("u" "Unscheduled TODOs"
                 ((todo ""
                        ((org-agenda-overriding-header "\nUnscheduled TODO")
                         (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp 'todo '("DONE" "CANCELLED" "MAYBE" "WAITING" "SOMEDAY"))))))) t)
)
#+END_SRC

#+RESULTS:
| n | Agenda and all TODOs | ((agenda ) (alltodo ))                 |
| u | Unscheduled TODOs    | ((todo  ((org-agenda-overriding-header |
** Capturing

Define a few common tasks as capture templates. Specifically, I frequently:

- Record ideas for future blog posts in =blog-ideas.org=,
- Record everything related to Phd stuff in =~/Phd Notebook.org=, and
- Maintain a todo list in =to-do.org=.
- Maintain a reading list in =to-read.org=

#+BEGIN_SRC emacs-lisp
(defun org-journal-find-location ()
  ;; Open today's journal, but specify a non-nil prefix argument in order to
  ;; inhibit inserting the heading; org-capture will insert the heading.
  (org-journal-new-entry t)
  ;; Position point on the journal's top-level heading so that org-capture
  ;; will add the new entry as a child entry.
  (goto-char (point-min)))

#+END_SRC

#+RESULTS:
: org-journal-find-location

#+BEGIN_SRC emacs-lisp
   (after! org   (setq org-capture-templates
            (quote (

                    ("p" "Protocol" entry (file+headline org-index-file "Links")
                     "* %^{Title}\nCaptured On: %U\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
                    ("L" "Protocol Link" entry (file+headline org-index-file "Links")
                     "* %? [[%:link][%:description]] \nCaptured On: %U")

                    ("P" "Project" entry (file+headline org-basb-main-file "Projects")
                     (file "~/.doom.d/templates/newProjecttemplate.org") :empty-lines 1)

                    ("s" "Someday" entry (file+headline "~/Orgs/BASB/somedaymaybe.org" "Someday / Maybe")
                     "* SOMEDAY %?\n")
                    ("m" "Maybe" entry (file+headline "~/Orgs/BASB/somedaymaybe.org" "Someday / Maybe")
                     "* MAYBE %?\n")


                    ("n" "Notes"
                     entry
                     (file+headline org-index-file "Notes")
                     "* %u %? :NOTE:\n")

                    ("t" "Task"
                     entry
                     (file+headline org-index-file "Tasks")
                     "* TODO %?\n")

                     ("h" "health log")
                    ("hr" "Running" entry (file+headline  "~/Orgs/BASB/Areas/Health/log.org" "Running")
                     (file "~/.doom.d/templates/running.org") :empty-lines 1)

                    ("hs" "Sleep" entry (file+headline  "~/Orgs/BASB/Areas/Health/log.org" "Sleep")
                     (file "~/.doom.d/templates/sleep.org") :empty-lines 1)


                    ("e" "Email" entry (file+headline org-index-file "Mail")
                     "* TODO %? email |- %:from: %:subject :EMAIL:\n:PROPERTIES:\n:CREATED: %U\n:EMAIL-SOURCE: %l\n:END:\n%U\n" )



                    ("H" "Habit" entry (file org-index-file)
                     "* TODO %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: TODO\n:END:\n")


                     ("j" "Journal")
                    ("ji" "Inaya Journal" entry (file+olp+datetree "~/Orgs/BASB/Areas/Parenting/Journal.org")
                     "** %(format-time-string \"%R\") %?  \n")

                    ("jp" "Personal Journal" entry (file+olp+datetree "~/Orgs/jrl/journal.org")
                     "** %(format-time-string \"%R\") %? \n")

                    ("jm" "Routine Journal" entry (function org-journal-find-location)
                     (file "~/.doom.d/templates/journal.org") :empty-lines 1)


                    ("c" "cooking")
                    ("cr" "Cookbook" entry (file "~/Orgs/BASB/Reference/Cookbook/cookbook.org")
                     "%(org-chef-get-recipe-from-url)"
                     :empty-lines 1)

                    ("cm" "Manual Cookbook" entry (file "~/Orgs/BASB/Reference/Cookbook/cookbook.org")
                     "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")

              )


                    ))

)

#+END_SRC

#+RESULTS:
| p | Protocol | entry | (file+headline org-index-file Links) | * %^{Title} |

